app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "rami"], ["last_name", "risk"], ["email", "rami@gtlogic.com"], ["created_at", "2021-03-02 09:24:22.818654"], ["updated_at", "2021-03-02 09:24:22.818654"], ["role", "admin"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "hussein"], ["last_name", "hraibeh"], ["email", "hah"], ["updated_at", "2021-03-01 22:25:59.286685"], ["id", 1]]